# IFCLegacyStairOrRamp Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCLegacyStairOrRamp Properties
IFCLegacyStairOrRamp Class See Also
---
The IFCLegacyStairOrRamp type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsRamp | True if it is a ramp, false if it is a stair. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| RiserHeight | The height of riser. |

# See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace